---
kind: property
id: P:Autodesk.Revit.DB.FamilyElementVisibility.IsShownOnlyWhenCut
source: html/3c68a291-cbf5-77c9-d15b-e8ed49d8d9f2.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility.IsShownOnlyWhenCut Property

Indicates if the instance is displayed only if it has been cut.

## Syntax (C#)
```csharp
public bool IsShownOnlyWhenCut { get; set; }
```

## Remarks
This property matters for objects which visibility type is ViewSpecific.